---
kind: property
id: P:Autodesk.Revit.DB.DisciplineTypeId.Energy
source: html/45b396a7-6170-b4e7-888a-866c5ec341d0.htm
---
# Autodesk.Revit.DB.DisciplineTypeId.Energy Property

Energy.

## Syntax (C#)
```csharp
public static ForgeTypeId Energy { get; }
```